SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-63608-F

Comment( ******REPORT BASED ADVANCED FEATURES APPLIED******* )

Comment( ************** General Information***************** )
Type ( Engine )
WagonShape ( ccw_br_o4_63608.s )
Size  ( 2.665m 4.125m 11.83257m )
WheelRadius ( 21in )comment (Front Bogie)
Mass ( 73.2t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 608kN 1220kN )
			r0 ( 10cm 0cm )
		)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 20cm 0cm )
			)
	)
	
Comment( ********** Brakes, Type, Force, etc *************** )
BrakeEquipmentType( Vacuum_brake, Auxilary_reservoir )
BrakeSystemType( Vacuum_single_pipe )
MaxBrakeForce( 200kN )
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )

ORTSNumberBrakeCylinders ( 2 )
Comment ( Assume 1 x 30in vacuum cylinder with 9in stroke )
Comment ( OpenRails assumes 4.5in stroke so this is set as two cylinders )
ORTSBrakeCylinderSize ( 30in )
ORTSAuxilaryResCapacity ( 8.25ft^3 ) Comment ( Based on Phillipson 16.5ft^3 vacuum chamber for 30in x 9in vacuum cylinder )

Brakepipevolume (1.29ft^3 ) Comment (* based on length of loco plus 16 feet for bends, branches and hoses *)

MaxReleaseRate ( 2.5inHg/s ) 
Comment ( use MaxReleaseRate ( 10inHg/s ) for steam braked class V2; MaxReleaseRate ( 2.5inHg/s )for vacuum braked class V2 )

MaxApplicationRate ( 2.0inHg/s )
Comment ( use MaxApplicationRate ( 1.3inHg/s ) for steam braked class V2; MaxApplicationRate ( 2.0inHg/s )for vacuum braked class V2 )

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121) 

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.8m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 17.0ft 6.0in )
Comment( No. Wheels-1 x 5/4 )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )


Comment( CN 1990 DWx18)
ORTSDavis_A ( 7063 )
ORTSDavis_B ( 24.47 )
ORTSDavis_C ( 5.432 )

ORTSWagonFrontalArea (100)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights ( 10
  Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
    Headlight ( 0 )
    Unit ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 2.2 -4.75 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ffe610 )
   Position ( -0 2.2 -4.8 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.4 )
         
     )
    )
   )
  Light ( 
   comment( Gauge glass Lamp )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0 3.2 -4.987550 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.35 )
     )
    )
   )
  Light (
   comment( Flickering Ashpan Back )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.4 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( 0 0.45 -4.5 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1 )
         
     )
    )
   )

  Light (
   comment( Sphere of light for Exhaust )
   Type  ( 1 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   Cycle  ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ffe610 )
   Position ( 0 10.0 -14.75 )
   Transition ( 0 )
   Radius ( 6.0 )
   Angle ( 90.0 )
                               )
                         )
         )
  Light ( 
   comment( Ashpan flashes ) 
   Type ( 0 ) 
   Conditions ( 
   Headlight ( 3 ) 
   Unit ( 0 ) 
   ) 
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 1 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 01.4 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.4 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.2 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 3 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.50 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -2.5 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 1 ) 
                  )
               )
          )

  Light ( 
   comment( Chimney Sparks RS1AA ) 
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   TimeOfDay ( 0 )
   Weather ( 0 )
   Coupling ( 0 )  
   )
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.42 3.4 )

   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.15 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.72 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.10 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.52 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.72 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.15 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.92 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.10 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.32 3.4 )
  
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.15 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.52 3.4 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.92 3.4 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.1 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.35 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.55 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.130 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.535 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.4 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.5135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.35 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.4)
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.135 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.233 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.23 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.23 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 9.22 3.4 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.230 ) 
                  )
               )
          )
  
 Light (
   comment( light white D )
   Type ( 0 )
   Conditions (
   Headlight ( 4 )
   Unit ( 2 )
   Service ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut( 0.5 )
   Cycle   ( 0 )
   States( 1
   State (
   Duration ( 0.05 )
   LightColour ( cccccccc )
   Position ( -1 1.45 5.53 )
   Azimuth ( 0.0 0 0 )
   Transition ( 0 )
   Radius ( 0.6 )
    )
    )
    )
 Light (
   comment( light red D reversed )
   Type ( 0 )
   Conditions (
   Headlight ( 4 )
   Unit ( 4 )
   Service ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut( 0.5 )
   Cycle   ( 0 )
   States( 1
   State (
   Duration ( 0.05 )
   LightColour ( ccff0000 )
   Position ( -1 1.45 5.53 )
   Azimuth ( 0 0 0 )
   Transition ( 0 )
   Radius ( 0.6 )
    )
    )
    )
 Light (
   comment( light white A )
   Type ( 0 )
   Conditions (
   Headlight ( 4 )
   Unit ( 2 )
   Service ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut( 0.5 )
   Cycle   ( 0 )
   States( 1
   State (
   Duration ( 0.05 )
   LightColour ( cccccccc )
   Position ( 0 3.3 4.4 )
   Azimuth ( 0.0 0 0 )
   Transition ( 0 )
   Radius ( 0.6 )
    )
    )
    )
 Light (
   comment( light red A reversed )
   Type ( 0 )
   Conditions (
   Headlight ( 4 )
   Unit ( 4 )
   Service ( 2 )
   )
   FadeIn ( 0.5 )
   FadeOut( 0.5 )
   Cycle   ( 0 )
   States( 1
   State (
   Duration ( 0.05 )
   LightColour ( ccff0000 )
   Position ( 0 3.3 4.4 )
   Azimuth ( 0 0 0 )
   Transition ( 0 )
   Radius ( 0.6 )
    )
    )
    )
    )
	
Comment( ******* Miscellaneous Wagon Information************ )

Comment (Passenger View)	
	Inside (
        PassengerCabinFile ( ccw_br_o4_63608.s )
        PassengerCabinHeadPos ( 1.423 3.0 -3.5 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)
 Sound (	"..\\..\\Common.Steam\\2Cylinder\\K1eng.sms" )
)

Engine ( OR-63608-F

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)
   WhistleFX
   (
    0 3.85 -4.1
    0 1 0
    0.15
   )
   SafetyValvesFX
   (
    0 3.95 -3.15
    0 1 0
    0.350
   )
   StackFX
   (
    0 4.20 3.45
    0 1 0
    0.25
   )
   DrainpipeFX
   (
    -1.5 1.258 -3.886
    0 -1 0
    0.05
   )
			
Injectors2FX
	(
	-1.2 1.2 -5.1
	0 -1 0
	0.12
	)
Injectors1FX
	(
	1.2 1.2 -5.1
	0 -1 0
	0.12
	)
Comment( Cylinder Cock Pipe Angle )
Comment( 5 deg UP y/z )
Comment( tan5 = 0.0875 )
CylindersFX
   (
    -1 0.75 3.8
    0 0.0875 1 
    0.14
   )
Comment( Cylinder Cock Pipe Angle )
Comment( 5 deg UP y/z )
Comment( tan5 = 0.0875 )
CylindersFX
   (
    1 0.75 3.8
    0 0.0875 1
    0.14
   )
  )
)

Wagon ( OR-63608-F )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 28in )
NumWheels ( 4 )
ORTSDriveWheelWeight ( 68.2t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 242ft^3 )  
ORTSEvaporationArea ( 1503ft^2 )
ORTSSuperheatArea ( 242ft^2 )
MaxBoilerPressure ( 180psi )

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 26in ) 
CylinderDiameter ( 21in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 26.24ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ****************** Fuel ************************* )

MaxTenderCoalMass ( 6t-uk )
MaxTenderWaterMass ( 40000lb )
IsTenderRequired( 1 )	

ORTSWaterScoopFillElevation ( 2.8m )
ORTSWaterScoopDepth ( 3.0in ) Comment (* LNER standard scoop - depth varies depending on trough and area of operation *)
ORTSWaterScoopWidth ( 10.875in )


Comment(       ********ADVANCED PARAMETERS**********      )

ORTSBoilerEvaporationRate ( 14 )   Comment(Set to acheive max steaming rate from report)

Comment(ORTSMaxIndicatedHorsepower ( 1075.0hp ))   

ORTSMaxSuperheatTemperature ( 250.0 )   

Comment(ORTSSuperheatCutoffPressureFactor ( 35.0 ))   Comment(Set to acheive correct steam and fuel rates - but no longer used from Jan 2022)

Comment(ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.96 ))

ORTSBoilerEfficiency( 0.0 0.91  190.0 0.455 )   
Comment(From Report)

ORTSBurnRate( 0.0 10.0   12000.0 1430.0   14000.0 1725.0   18000.0 2350.0   22000.0 3110.0   26000.0 4030.0   30000.0 5270.0   31000.0 5760.0  33000.0 8640 )   
Comment(From Report)

    
Comment ( ****************Brake System ******************** )   

BrakesTrainBrakeType( "Vacuum_single_pipe" )
ORTSBrakePipeTimeFactor ( 0.03s )
TrainPipeLeakRate ( 0.03inHg/s )


Comment ( *** Ejectors *** )
Comment (* Estimate for Davies & Metcalfe Type VB ejector *)
VacuumBrakesHasVacuumPump ( 0 )
ORTSBrakePipeChargingRate ( 0.32inHg/s )
VacuumBrakesLargeEjectorUsageRate ( 600lb/h )
VacuumBrakesSmallEjectorUsageRate ( 240lb/h )
VacuumBrakesMinBoilerPressureMaxVacuum ( 90psi )


Comment ( *** Train Brake Valve *** )
TrainBrakesControllerMaxSystemPressure ( 21inHg )
ORTSBrakeEmergencyTimeFactor ( 5s )
ORTSBrakePipeTimeFactor ( 0.02s )
ORTSBrakeServiceTimeFactor ( 10.0s )


Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.2
NumNotches( 3
Notch(0    0 TrainBrakesControllerReleaseStart )
Notch(0.1  0 TrainBrakesControllerRunningStart )
Notch(0.2  1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )

ORTSSmallEjector ( 0 1 0.1 0.55 NumNotches ( 0 ) )


FireDoor ( 0 1 0.1 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
ORTSSteamHeat( 0 1 0.0125 0.5 )
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( B1.cvf )
HeadOut (  -1.423 3.0 -3.5 )
Sound ( "..\\..\\Common.Steam\\2Cylinder\\K1cab.sms" )
Name ( "63608 O4 Robinson, XP All Unfitted ClassF, Retford Shed 36E, TE\n"+ " 31.33Klbf" )
Description (
"Initial allocations of the O4s were to Gorton, Mexborough, Annesley, Retford, Stavely, Sheffield, and Immingham. Mexborough had the largest allocation, and would continue to do so until 1939. Sheds along the London Extension did not receive any O4s until 1914, when Neasden received three O4s to haul coal trains from Annesley to London. Mexborough O4s handled the bulk of the coal traffic over the Woodhead Route.\n"+
"\n"+
"The LNER's large purchases of ROD locomotives, meant the O4s fulfilled virtually all of the LNER's heavy mineral locomotive requirements until Nationalisation (1948). The bulk of the O4s were located to the Southern Area (381 total), with small allocations to the North Eastern Area (24) and Scottish Area (16). Allocations tended to be to a greater range of sheds during World War 2.\n"+
"\n"+
"278 O4s and 51 O1 rebuilds survived into British Railways ownership (1948). The GWR also handed 45 RODs into British Railways ownership. Between 1948 and 1949, seven O4s would be rebuilt as O1.\n"+
"\n"+
"The O4s survived in good strength into British Railways, and many were kept for colliery trip work in South Yorkshire. Withdrawals started in December 1958 and progressed at a steady rate, although they continued to perform good solid work during the 1960s. The last O4 with an original Belpaire boiler design was withdrawn in February 1966. The class finally disappeared from service in April 1966 when four O4/8s were withdrawn."
)
)
